{
  "Deadly": { 
    "Name": "Deadly", 
    "Type": "Melee", 
    "Description": "This unit has Advantage on Injury Checks in Melee. This means that, if this unit hits, roll a d20 and use that as the Injury value if it is higher than the Melee Check result (before modifiers)."
  },
  "Hard to Kill": { 
    "Name": "Hard to Kill", 
    "Type": "Inherent", 
    "Description": "This unit has a -2 to Injury rolls made against it (eg. an unmodified roll of 19 would count as a 17, Stunning rather than Incapacitating the unit)."
  },
  "Divine Cure": { 
    "Name": "Divine Cure", 
    "Type": "Inherent", 
    "Description": "Once at the end of the game, if this unit was not Incapacitated, it may attempt to cure someone of the Blight. After making Scar and Blight rolls, this unit makes a Morale Check. On a success, select a unit that has the Blight. It no longer has the Blight."
  },
  "Turncloak": { 
    "Name": "Turncloak",
    "Type": "Inherent", 
    "Description": "At the end of your opponent's Move Phase, if this unit is not carrying a Treasure, it can be bribed to switch sides. If your opponent has a unit with Treasure within 2\" of this unit, your opponent can make this unit make a Morale Check. On a failure, this unit takes the Treasure and is now under your opponent's conrol for the remainder of the battle. If it was Engaged with an enemy unit, it is no longer Engaged with them. If this unit has a Treasure at the end of the battle, it is lost."
  },
  "Stupor": { 
    "Name": "Stupor", 
    "Type": "Inherent", 
    "Description": "When this unit attempts to Engage, make a Morale Check. On a failure, the Engage fails and the unit moves 5\" away from the target."
  },
  "Temporary Ally": { 
    "Name": "Temporary Ally", 
    "Type": "Inherent", 
    "Description": "This unit eventually becomes hostile to all other units. At the end of your Upkeep Phase, if at least one of your units was Incapacitated last turn, your Leader makes a Morale Check. On a failure, this unit becomes hostile. From now on, it will act during the Neutral Step of the next player's Upkeep Phase. It uses the usual rules for Neutral Units and performs normal actions."
  },
  "Fence": { 
    "Name": "Fence", 
    "Type": "Inherent", 
    "Description": "If this unit ends the game with a Treasure, the player can forgo rolling for Income for this Treasure. If they do so, roll on the Loot table and gain that Loot."
  },
  "Thief": { 
    "Name": "Thief", 
    "Type": "Inherent", 
    "Description": "This unit can Run while carrying Treasure."
  },
  "Disengage": { 
    "Name": "Disengage", 
    "Type": "Inherent", 
    "Description": "At the end of your Upkeep Phase, if this unit is Engaged it may make a Morale Check. If it succeeds, it may move 1\" to get out of the Engage. It may not Engage this turn."
  },
  "Bounty Hunter": { 
    "Name": "Bounty Hunter", 
    "Type": "Inherent", 
    "Description": "At the start of the game, select an enemy hero at random to be the target. This unit may not Engage, Intercept, or make Ranged Attacks against any other units until the target is Incapacitated. If Engaged, this unit will fight back as usual. This unit has Advantage on attacks against the target. When the target is Incapacitated, it drops a Treasure as if it was holding one."
  },
  "Shove": { 
    "Name": "Shove", 
    "Type": "Melee", 
    "Description": "At the end of Melee combat, if this unit is not Dazed, Stunned, or Incapacitated, it can attempt to Shove an enemy it is Engaged with. That unit must make an Agility Check. If it fails, it is pushed directly back 2\"."
  },
  "Fencing Specialist": {
    "Name": "Fencing Specialist", 
    "Type": "Agility", 
    "Description": "If this unit is using a one-handed weapon and no Shield, they have Advantage on Melee Checks and Defence Checks in Melee."
  },
  "Great Weapon Specialist": { 
    "Name": "Great Weapon Specialist", 
    "Type": "Melee", 
    "Description": "If this unit is using a two-handed weapon, the enemy has Disadvantage on Defence Checks against them in Melee."
  },
 "Dual Wielding Specialist": { 
    "Name": "Dual Wielding Specialist", 
    "Type": "Melee", 
    "Description": "If this unit is dual wielding Melee weapons, it double its Attacks in Melee instead of gaining the usual one additional Attack."
  },
 "Shield Specialist": { 
    "Name": "Shield Specialist", 
    "Type": "Defence", 
    "Description": "If this unit is using a Shield, it gains one additional Attack in Melee."
  },
  "Drag You Down": { 
    "Name": "Drag You Down", 
    "Type": "Defence", 
    "Description": "If this unit is Incapacitated in Melee, the Incapacitator makes an Injury Roll after resolving its Melee Attacks."
  },
  "Taunt": { 
    "Name": "Taunt", 
    "Type": "Defence", 
    "Description": "Once per turn, if an enemy attempts to Engage an ally within 5\" of this unit, this unit may make a Morale Check. On a success, the enemy attempts to Engage this unit instead."
  },
  "Hero Killer": { 
    "Name": "Hero Killer", 
    "Type": "Melee", 
    "Description": "If this unit rolls an unmodified Melee Attack of 18-20, the target automatically fails its Defence Check."
  },
  "Cleave": { 
    "Name": "Cleave", 
    "Type": "Melee", 
    "Description": "If this unit Incapacitates an enemy in Melee, they may immediately make another Attack."
  },
   "Magebane": { 
    "Name": "Magebane", 
    "Type": "Melee", 
    "Description": "This unit has Advantage against Casters in Melee."
  },
  "Improved Critical": { 
    "Name": "Improved Critical", 
    "Type": "Melee", 
    "Description": "This unit can trigger a critical strike on a 19-20"
  },
  "Ambush": { 
    "Name": "Ambush", 
    "Type": "Melee", 
    "Description": "This unit gets Advantage on the first round of combat when they Engage an enemy."
  },
  "Spell Sniper": { 
    "Name": "Spell Sniper", 
    "Type": "Morale", 
    "Description": "This unit's Cast Attack spells have their range increased by 5\"."
  },
  "Sneaky": { 
    "Name": "Sneaky", 
    "Type": "Agility", 
    "Description": "This unit makes Out-of-Sight Rolls with Advantage."
  },
  "Thief": { 
    "Name": "Thief", 
    "Type": "Agility", 
    "Description": "This unit may pick up Treasure, even when it is contested."
  },
  "Animal Handler": { 
    "Name": "Animal Handler", 
    "Type": "Morale", 
    "Description": "This unit may make a Morale Check against an Animal within 5\" during the Ranged Phase (instead of a Ranged Attack). If the unit passes, the Animal cannot Engage or Move on its following turn."
  },
  "Coup de Grace": { 
    "Name": "Coup de Grace", 
    "Type": "Agility", 
    "Description": "This unit may target Dazed or Stunned enemies, even if a non-Stunned or Dazed enemy is Engaged with them."
  },
  "Defensive Stance": { 
    "Name": "Defensive Stance", 
    "Type": "Defence", 
    "Description": "Enemies don't automatically attack first in Melee on the turn they Engage this unit. Instead, unless this unit is already Engaged, it makes an Agility Check. If it succeeds, it instead attacks before all Engaged enemies this turn."
  },
  "Protector": { 
    "Name": "Protector", 
    "Type": "Defence", 
    "Description": "You have Advantage on Morale checks to Protect other units from Ranged Attacks and always count as being in Cover when doing so."
  },
  "Gunner": { 
    "Name": "Gunner", 
    "Type": "Ranged", 
    "Description": "This unit cannot misfire with Blackpowder weapons (the Blunderbuss can still misfire)."
  },
  "Piercing Shot": { 
    "Name": "Piercing Shot", 
    "Type": "Ranged", 
    "Description": "This unit may roll Ranged Attacks with Disadvantage. If it does, the enemy cannot make Defence checks."
  },
  "Leap": { 
    "Name": "Leap", 
    "Type": "Agility", 
    "Description": "This unit's max jump distance is increased by 3\". It also has Advantage on Jump Across Checks."
  },
   "Arbalist": { 
    "Name": "Arbalist", 
    "Type": "Ranged", 
    "Description": "Crossbows used by this unit gain +2 Injury."
  },
  "Archer": { 
    "Name": "Archer", 
    "Type": "Ranged", 
    "Description": "Bows used by this unit gain Close Quarters."
  },
  "Heavy Gunner": { 
    "Name": "Heavy Gunner", 
    "Type": "Ranged", 
    "Description": "This unit may use any Ranged weapon with a Shield."
  },
  "Sprint": { 
    "Name": "Sprint", 
    "Type": "Agility", 
    "Description": "This unit's Run speed is double its base Move."
  },
  "Sturdy": { 
    "Name": "Sturdy", 
    "Type": "Defence", 
    "Description": "This unit cannot be Staggered."
  },
  "Sniper": { 
    "Name": "Sniper", 
    "Type": "Ranged", 
    "Description": "This unit gains +5\" range to all Ranged weapons."
  },
  "Run and Gun": { 
    "Name": "Run and Gun", 
    "Type": "Ranged", 
    "Description": "This unit can make a Ranged Attack on its turn even if it had Run during the Move Phase."
  },
  "Agile": { 
    "Name": "Agile", 
    "Type": "Agility",
    "Description": "This unit gets Advantage on all Climb checks."
  },
  "Iron Will": { 
    "Name": "Iron Will", 
    "Type": "Morale", 
    "Description": "If a leader takes this skill they may extend their 'Leader' skill's range by 5\"."
  },
  "Favourable Encounter": { 
    "Name": "Favourable Encounter", 
    "Type": "Morale", 
    "Description": "If a unit from your warband triggers an Event, you may draw an additional Faction Agent card and choose which Faction Agent will be used for the Event."
  },
  "Treasure Hunter": {
	"Name": "Treasure Hunter", 
    "Type": "Morale", 
    "Description": "If any unit in the your warband has this skill, you can roll on the Loot table when rolling a 19-20 on a Treasure Roll, rather than the usual 20."
  },
  "Spell Master": { 
    "Name": "Spell Master", 
    "Type": "Morale", 
    "Description": "This unit lowers the Difficulty of Spells by 1."
  },
  "War Caster": { 
    "Name": "War Caster", 
    "Type": "Morale", 
    "Description": "This unit has Advantage on Moracle checks for Ongoing Spells."
  },
  "Hoarder": { 
    "Name": "Hoarder", 
    "Type": "Morale", 
    "Description": "When a unit of your warband dies you can keep one piece of equipment from that unit. This skill can be used once per battle and cannot be used on Rare Consumables, Oddments, Armour, or Weapons."
  },
  "Fear": { 
    "Name": "Fear", 
    "Type": "Morale",
    "Description": "This unit causes Fear."
  },
  "Leader": {
    "Name": "Leader",
    "Type": "Inherent",
    "Description": "Allied, non-animal units within 5\" of this unit can use this unit's Morale stat for Checks instead of their own."
  },
  "No Equipment": {
    "Name": "No Equipment",
    "Type": "Inherent",
    "Description": "This unit may not have any equipment, but does not suffer the penalties for fighting Unarmed."
  },
  "Healer": {
    "Name": "Healer",
    "Type": "Inherent",
    "Description": "This unit can use the 'Heal' Divine Magic spell."
  },
  "Mounted": {
    "Name": "Mounted",
    "Type": "Inherent",
    "Description": "This unit cannot use ladders or make Climb Checks. It gains +3 Mov and +1 Wnd, which are already reflected in its stat block."
  },
  "Divine Magic": {
    "Name": "Divine Magic",
    "Type": "Spellcasting",
    "Description": "This unit is capable of casting Divine Magic. See the relevant spell list for a list of learnable spells. As a Divine Caster, this unit has the usual three slots for weapons and can use armour and shields as normal."
  },
  "Necromantic Magic": {
    "Name": "Necromantic Magic",
    "Type": "Spellcasting",
    "Description": "This unit is capable of casting Arcane Magic. See the relevant spell list for a list of learnable spells. As an Arcane Caster, this unit has an innate 'Basic' spell that is always castable and is in addition to other spells learnt. It also only has a single weapon slot which must be a melee weapon and is unable to use armour or a shield."
  },
   "Life Magic": {
    "Name": "Life Magic",
    "Type": "Spellcasting",
    "Description": "This unit is capable of casting Arcane Magic. See the relevant spell list for a list of learnable spells. As an Arcane Caster, this unit has an innate 'Basic' spell that is always castable and is in addition to other spells learnt. It also only has a single weapon slot which must be a melee weapon and is unable to use armour or a shield."
  },
  "Ki Strike": {
    "Name": "Ki Strike",
    "Type": "Inherent",
    "Description": "When fighting Unarmed, targets roll their Defence Check with Disadvantage."
  },
  "Weaponsmith": {
    "Name": "Weaponsmith",
    "Type": "Inherent",
    "Description": "If a warband starts a game with a unit with this Skill, all Ranged Weapons have their Range increased by 10\", except for Pistols whose Range is incrased by 5\". Blunderbuss range is unaffected."
  },
  "Armoursmith": {
    "Name": "Armoursmith",
    "Type": "Inherent",
    "Description": "If a warband contains a unit with this Skill, it gains the ability to purchase Mithril Armour."
  },
  "Berserker": {
    "Name": "Berserker",
    "Type": "Inherent",
    "Description": "At the end of the Engage Phase, if there is an enemy within Line-of-Sight and Engage range, this unit attempts to Engage the closest such unit."
  },
  "Deathwish": {
    "Name": "Deathwish",
    "Type": "Inherent",
    "Description": "This unit cannot equip Armour, Shields, or Ranged Weapons."
  },
  "Spread Blight (Major)": {
    "Name": "Spread Blight (Major)",
    "Type": "Inherent",
    "Description": "If this unit Incapacitates or is Incapacitated by an enemy in Melee, that unit must make a Morale Check. If they fail it, they immediately contract the Blight. This unit is immune to the Blight."
  },
  "Blight for the Blight God": {
    "Name": "Blight for the Blight God",
    "Type": "Inherent",
    "Description": "This unit is immune to the Blight. At the start of the game, select an ally unit that does not have the Blight. It contracts the Blight."
  },
  "Spread Blight (Minor)": {
    "Name": "Spread Blight (Minor)",
    "Type": "Inherent",
    "Description": "If this unit Incapacitates an enemy in Melee, that unit must make a Morale Check. If they fail it, they immediately contract the Blight. This unit is immune to the Blight. If this unit is Incapacitated in Melee, nothing happens."
  },
  "Pit Fighter": {
    "Name": "Pit Fighter",
    "Type": "Inherent",
    "Description": "This unit treats Dazed results against it as Staggered instead."
  },
  "Raise Ally": {
    "Name": "Raise Ally",
    "Type": "Inherent",
    "Description": "This unit can cast the 'Raise Ally' spell: One allied unit that was Incapacitated after the end of your last turn immediately returns to the battle as a Zombie (use the same stats as the Undead warband Zombie). It no longer counts towards your Rout Threshold. Place the model within 5\" of the Caster. The model cannot be placed such that it is Engaged with an enemy."
  },
  "Unholy Presence": {
    "Name": "Unholy Presence",
    "Type": "Inherent",
    "Description": "Any allies of this unit have Disadvantage on all Morale Checks."
  },
  "Ethereal": {
    "Name": "Ethereal",
    "Type": "Inherent",
    "Description": "This unit may move through terrain and other units as if they weren't there, but may not ends its movement inside of terrain or other units. It must still make Out-of-Sight Rolls as normal and must move through terrain or units when Engaging if this will make the path to its target shorter. It may be intercepted by enemies as normal. It may not Protect others from Ranged Attacks."
  },
  "Undead": {
    "Name": "Undead",
    "Type": "Inherent",
    "Description": "This unit may not Run, but may Engage as normal (ie. up to 1.5x of base Move). If this unit would be Stunned, it is instead counted as Dazed. This unit is immune to the Blight."
  },
   "Follower": {
    "Name": "Follower",
    "Type": "Inherent",
    "Description": "This unit does not count for the purposes of a warband's max units."
  },
   "Animal": {
    "Name": "Animal",
    "Type": "Inherent",
    "Description": "This unit cannot Promote, use ladders (except by making a full Climb Check), pick up Treasure, benefit from the 'Leader' skill or use equipment (but is not penalised for fighting Unarmed)."
  },
   "Slow": {
    "Name": "Slow",
    "Type": "Inherent",
    "Description": "This unit may not Run, but may Engage as normal (ie. up to 1.5x of base Move)."
  },
  "Rally the Troops": {
    "Name": "Rally the Troops",
    "Type": "Inherent",
    "Description": "Allied units within 5\" of this unit can roll Morale Checks with Advantage. Rout Checks cannot gain Advantage in this way."
  },
  "Vampiric Magic": {
    "Name": "Vampiric Magic",
    "Type": "Spellcasting",
    "Description": "This unit is capable of casting Arcane Magic. See the relevant spell list for a list of learnable spells. As an Arcane Caster, this unit has an innate 'Basic' spell that is always castable and is in addition to other spells learnt. It also only has a single weapon slot which must be a melee weapon and is unable to use armour or a shield."
  },
  "Flying": {
    "Name": "Flying",
    "Type": "Inherent",
    "Description": "This unit can move through the air in any direction. They must not end their movement in the air."
  },
  "Blight Magic": {
    "Name": "Blight Magic",
    "Type": "Spellcasting",
    "Description": "This unit is capable of casting Arcane Magic. See the relevant spell list for a list of learnable spells. As an Arcane Caster, this unit has an innate 'Basic' spell that is always castable and is in addition to other spells learnt. It also only has a single weapon slot which must be a melee weapon and is unable to use armour or a shield."
  },
  "Cowardly": {
    "Name": "Cowardly",
    "Type": "Inherent",
    "Description": "If this unit is not within 5\" of an allied hero at the start of its turn, it cannot act during the Engage, Move, Cast, and Ranged phases. It can act in Melee Combat as normal."
  },
  "Large": {
    "Name": "Large",
    "Type": "Inherent",
    "Description": "This unit may not be purchased at warband creation. It counts as two units for the purpose of Rout Checks. It cannot pick up Treasure. This unit is immune to the Blight. It cannot Promote."
  },
  "Inquisitor": {
    "Name": "Inquisitor",
    "Type": "Inherent",
    "Description": "This unit gets a +2 Pierce modifier against all enemy heroes for melee attacks."
  },
  "The Rapture is Nigh": {
    "Name": "The Rapture is Nigh",
    "Type": "Inherent",
    "Description": "This unit counts as two heroes for the purposes of the 'Incite the Mob' special rule."
  },
  "Heed the Scripture": {
    "Name": "Heed the Scripture",
    "Type": "Inherent",
    "Description": "This unit can use the morale of the Doomsayer if they are within 5\" of it."
  },
  "Mob Mentality": {
    "Name": "Mob Mentality",
    "Type": "Inherent",
    "Description": "This unit cannot pick up Treasure. If this unit is not within 5\" of a Peasant or Doomsayer at the end of the Upkeep Phase, it must make a Morale Check. If it fails, it is immediately Incapacitated."
  },
  "Pack Tactics": {
    "Name": "Pack Tactics",
    "Type": "Inherent",
    "Description": "If this unit attacks an enemy that is also in base contact with an ally that also has Pack Tactics, this unit has advantage on the attack."
  },
  "Fixed Equipment (Scythe)": {
    "Name": "Fixed Equipment (Scythe)",
    "Type": "Inherent",
    "Description": "This unit has fixed equipment that cannot be lost. The equipment modifers are included in the unit's stats and cost."
  },
  "Fixed Equipment (Farm Tools)": {
    "Name": "Fixed Equipment (Farm Tools)",
    "Type": "Inherent",
    "Description": "This unit has fixed equipment that cannot be lost or changed. The equipment modifers are included in the unit's stats and cost."
  },
  "Fixed Equipment (Holy Standard)": {
    "Name": "Fixed Equipment (Holy Standard)",
    "Type": "Inherent",
    "Description": "This unit has fixed equipment that cannot be lost or changed. The equipment modifers are included in the unit's stats and cost."
  },
  "Hatred": {
    "Name": "Hatred",
    "Type": "Inherent",
    "Description": "This unit hates a specific unit, unit type, or warband. This unit makes Melee Checks with Advantage against enemies it hates."
  },
  "Mark Target": {
    "Name": "Mark Target",
    "Type": "Inherent",
    "Description": "Once per Ranged Phase, instead of making a Ranged Attack, this unit may instead Mark an enemy unit within 10\" (and within line-of-sight) until the start of the next turn. A unit that is Marked can be targeted by Ranged Attacks even when the unit is Engaged, but cannot be Protected from such Ranged Attacks."
  },
  "Vampire": {
    "Name": "Vampire",
    "Type": "Inherent",
    "Description": "If there is a non-Undead, non-Animal ally within 2\" at the end of your Upkeep Phase and this unit has less than their maximum Wounds, you must immediately Incapacitate that ally to remove Staggered from this unit and gain one Wound."
  },
  "Vanguard": {
    "Name": "Vanguard",
    "Type": "Agility",
    "Description": "After unit deployment, but before any player takes their first turn, this unit may perform a Run. If multiple players have units with this skill, resolve it in turn order. This unit may never pick up Treasure tokens."
  },
    "Madness": {
    "Name": "Madness",
    "Type": "Inherent",
    "Description": "This unit makes all Morale Checks with Disadvantage."
  }
}